$$Pandas$$

In [2]:
import pandas as pd

There are two core objects in pandas: the $DataFrame$ and the $Series$.

$DataFrame$ is a table,contains an array of individual entries, each of which has a certain value. Each entry corresponds with a row (or record) and a column.

The syntax is a dictionary with the names of the columns as the keys and the values as what is to be filled in that particular column from top to bottom.

In [3]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

To fill in the rows too,we pass the "index" list with the row names,in the dataframe object.
For Eg:

In [4]:
pd.DataFrame({'Mon':['Data','Crit'],'Tue':['Crit','Data']},index=['8 to 9','9 to 10'])

          Mon   Tue
8 to 9   Data  Crit
9 to 10  Crit  Data

$Series$ is sequence of data values.It is ust like dataframe,except we only pass a list instead of a dictionary.It is a dataframe with only one column(which you can name by passing the "name" parameter in the series object).Here also,you can give labels to rows by passing index parameter.

In [5]:
pd.Series([1,3,5,7,9])
#pd.Series([1,3,5,7,9],index=['1st','2nd','3rd','4th','5th'])

0    1
1    3
2    5
3    7
4    9
dtype: int64

We'll mostly be reading in data from a csv file.A CSV file is a table of values separated by commas. Hence the name: "Comma-Separated Values", or CSV.

Product A,Product B,Product C,
30,21,9,
35,34,1,
41,11,11

In [6]:
#We read this data by :
df = pd.read_csv("./Data.csv")

To convert a given dataframe df into a csv file,named hello.csv,we write :

In [7]:
df.to_csv('hello.csv')

We can use the shape attribute to check how large the resulting DataFrame is.We can examine the contents of the resultant DataFrame using the head() command, which grabs the first five rows.

In [8]:
df.shape
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

The pd.read_csv() function is well-endowed, with over 30 optional parameters you can specify. To make pandas use a column for the index (instead of creating a new one from scratch), we can specify an index_col.

In [9]:
ddf = pd.read_csv("./Data.csv", index_col=0)

$Native$ $Accessors$

if a dataframe df has one of its colums named "country",then we can access it by df.country or df['country'].This prints a Series with the name being the name of the column.

In [10]:
df.Purchased
#df['Age']

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

df[Column Name][Row Name] gives out the element in that particular block.

In [11]:
df['Age'][1]

27.0

Index-based selection:
Pandas indexing works in one of two paradigms. The first is index-based selection: selecting data based on its numerical position in the data,eg: iloc/loc.


df.iloc[Row number] prints the whole row.
df.iloc[Row number,Column number] prints the element in that particular block.

To select the first row of data in a DataFrame,use:

In [12]:
df.iloc[0]
#df.iloc[:,0],df.iloc[1:3,0],df.iloc[[0,3,4],0] ,df.iloc[-5:]  
#These are all the ways to access the data in the dataframe

Country       France
Age             44.0
Salary       72000.0
Purchased         No
Name: 0, dtype: object

The second paradigm for attribute selection is the one followed by the loc operator: label-based selection. In this paradigm, it's the data index value, not its position, which matters.

In [13]:
df.loc[:, ['Age','Purchased']]

    Age Purchased
0  44.0        No
1  27.0       Yes
2  30.0        No
3  38.0        No
4  40.0       Yes
5  35.0       Yes
6   NaN        No
7  48.0       Yes
8  50.0        No
9  37.0       Yes

You can set any of the column and it's values as the index of the dataframe by using the set_index() method.

In [14]:
df.set_index("Country")

          Age   Salary Purchased
Country
France   44.0  72000.0        No
Spain    27.0  48000.0       Yes
Germany  30.0  54000.0        No
Spain    38.0  61000.0        No
Germany  40.0      NaN       Yes
France   35.0  58000.0       Yes
Spain     NaN  52000.0        No
France   48.0  79000.0       Yes
Germany  50.0  83000.0        No
France   37.0  67000.0       Yes

In [15]:
#df.loc[df.Age==44] #prints series of true and false
df.loc[(df.Age>40) & ~(df.Purchased=='Yes')] #prints the rows satisfying BOTH the conditions

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
8  Germany  50.0  83000.0        No

$df.Age.isin([..])$ lets you select data whose value "is in" a list of values.$df.Age.notnull()$ and $df.Age.null()$ prints rows which aren't or are empty respectively.For example:

In [16]:
df.loc[df.Age.isin([40.0, 48.0])]

   Country   Age   Salary Purchased
4  Germany  40.0      NaN       Yes
7   France  48.0  79000.0       Yes

The first function we'll introduce here is $rename()$, which lets you change row/column names.For eg:

In [17]:
rename_columns={'Purchased':'Bought'}
df.rename(columns=rename_columns,index={1:'1st'})

     Country   Age   Salary Bought
0     France  44.0  72000.0     No
1st    Spain  27.0  48000.0    Yes
2    Germany  30.0  54000.0     No
3      Spain  38.0  61000.0     No
4    Germany  40.0      NaN    Yes
5     France  35.0  58000.0    Yes
6      Spain   NaN  52000.0     No
7     France  48.0  79000.0    Yes
8    Germany  50.0  83000.0     No
9     France  37.0  67000.0    Yes

Both the row index and the column index can have their own name attribute. The complimentary rename_axis() method may be used to change these names. For example:

In [18]:
df.rename_axis("wines", axis='rows').rename_axis("fields", axis='columns')

fields  Country   Age   Salary Purchased
wines
0        France  44.0  72000.0        No
1         Spain  27.0  48000.0       Yes
2       Germany  30.0  54000.0        No
3         Spain  38.0  61000.0        No
4       Germany  40.0      NaN       Yes
5        France  35.0  58000.0       Yes
6         Spain   NaN  52000.0        No
7        France  48.0  79000.0       Yes
8       Germany  50.0  83000.0        No
9        France  37.0  67000.0       Yes

$Combining$ $DataFrames$

Pandas has three core methods for doing this. In order of increasing complexity, these are concat() & join().The simplest combining method is concat(). Given a list of elements, this function will keep df2 below df1,since they have same columns.

In [19]:
df1=pd.read_csv('hello.csv')
df2=pd.read_csv('hello.csv')
df1.shape
df2.shape
pd.concat([df1,df2]).shape

(20, 5)

join() lets you combine different DataFrame objects which have an index in common. For example:

In [20]:
df1.join(df2,lsuffix='_ONE',rsuffix='_TWO')

,Unnamed: 0_ONE,Country_ONE,Age_ONE,Salary_ONE,Purchased_ONE,Unnamed: 0_TWO,Country_TWO,Age_TWO,Salary_TWO,Purchased_TWO
0,0,France,44.0,72000.0,No,0,France,44.0,72000.0,No
1,1,Spain,27.0,48000.0,Yes,1,Spain,27.0,48000.0,Yes
2,2,Germany,30.0,54000.0,No,2,Germany,30.0,54000.0,No
3,3,Spain,38.0,61000.0,No,3,Spain,38.0,61000.0,No
4,4,Germany,40.0,NaN,Yes,4,Germany,40.0,NaN,Yes
5,5,France,35.0,58000.0,Yes,5,France,35.0,58000.0,Yes
6,6,Spain,NaN,52000.0,No,6,Spain,NaN,52000.0,No
7,7,France,48.0,79000.0,Yes,7,France,48.0,79000.0,Yes
8,8,Germany,50.0,83000.0,No,8,Germany,50.0,83000.0,No
9,9,France,37.0,67000.0,Yes,9,France,37.0,67000.0,Yes

Summary Functions

We have functions like describe(),value_counts(),unique(),mean(),median(),mode(),std(),min(),max(),count(),sum(),idxmax() [returns first occurence of max in axis given]etc. which can be used to get the respective values of the dataframe.

In [21]:
df.Age.describe()#generates high leveel summary of the attributes
df.Purchased.value_counts()

Purchased
No     5
Yes    5
Name: count, dtype: int64

$Maps$

A map is a term for a function that takes one set of values and "maps" them to another set of values. In pandas, maps are used to transform data.They DON'T TRANSFORM the data,but only prints the new data.For example:

There are two mapping methods that you will use often-map() to return Series and apply() to return a DataFrame.
map() takes in a Series object and returns the transformed Series.

In [22]:
df1.Age.map(lambda p : p-df1.Age.mean())

0     5.222222
1   -11.777778
2    -8.777778
3    -0.777778
4     1.222222
5    -3.777778
6          NaN
7     9.222222
8    11.222222
9    -1.777778
Name: Age, dtype: float64

apply() is the equivalent method if we want to transform a whole DataFrame by calling a custom method on each row.

In [23]:
def remean_points(row):
    row.Age = row.Age - dcxdcfxfrow.Age.mean()
    return row

df.apply(remean_points, axis='columns')#to change values in a column
df.apply(remean_points, axis='index')#to change values in a row

NameError: name 'dcxdcfxfrow' is not defined

One function we've been using heavily thus far is the value_counts() function. We can replicate what value_counts() does by doing the following:

In [ ]:
df.groupby('Age').Age.count()

Age
27.0    1
30.0    1
35.0    1
37.0    1
38.0    1
40.0    1
44.0    1
48.0    1
50.0    1
Name: Age, dtype: int64

fill here with info on panda's grouping and sorting

DataTypes
The data type for a column in a DataFrame or a Series is known as the dtype.

In [ ]:
df.Age.dtype
df.dtypes#returns datatypes of every columninn the dataframe

Country       object
Age          float64
Salary       float64
Purchased     object
dtype: object

We can change one datatype to another sensible dtype like :

In [24]:
df.Age.astype('float64')

0    44.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64

Missing Values
Missing values are generally filled with NaN,Not A Number.To access them we use :

In [25]:
df[pd.isnull(df.Age)]

  Country  Age   Salary Purchased
6   Spain  NaN  52000.0        No

To fill these missing values there are diff. strategies.

For ex,we can replace them with text

In [26]:
df.Age.fillna("Unknown")

0       44.0
1       27.0
2       30.0
3       38.0
4       40.0
5       35.0
6    Unknown
7       48.0
8       50.0
9       37.0
Name: Age, dtype: object

Or we could fill each missing value with the first non-null value that appears sometime after the given record in the database. This is known as the backfill strategy.

 we may have a non-null value that we would like to replace

In [27]:
df.Age.replace(44.0,48.0)

0    48.0
1    27.0
2    30.0
3    38.0
4    40.0
5    35.0
6     NaN
7    48.0
8    50.0
9    37.0
Name: Age, dtype: float64